Revit 2027 API
BuiltInFailures.FamilyFailures.CannotChangeCategory Property
 Can't change category of Family Instance
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotChangeCategory { get; }
Public Shared ReadOnly Property CannotChangeCategory As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotChangeCategory {
	FailureDefinitionId^ get ();
}
static member CannotChangeCategory : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace